Revit 2027 API
ExportDWGSettings.GetDXFExportOptions Method
 Gets the options stored in the these settings.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public DXFExportOptions GetDXFExportOptions()
Public Function GetDXFExportOptions As DXFExportOptions
public:
DXFExportOptions^ GetDXFExportOptions()
member GetDXFExportOptions : unit -> DXFExportOptions
Return Value
DXFExportOptions
 The options
See Also
Reference
ExportDWGSettings Class
Autodesk.Revit.DB Namespace